Clash Bot Observability Workspace - Plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ClashBot/ClashBot-Obs/runs/run-brUZn2SxBj8A79M1

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
data.tfe_outputs.clash-bot-discord-bot: Reading...
data.tfe_outputs.clash-bot-discord-bot: Read complete after 0s [id=ClashBot-ClashBot]
aws_iam_role.clash-bot-obs-lambda-role: Refreshing state... [id=clash-bot-obs-lambda-role]
aws_iam_policy.cloudwatch_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-cloudwatch-lambda-policy]
data.aws_caller_identity.current: Reading...
aws_security_group.clash-bot-lambda-sg: Refreshing state... [id=sg-0665c300d05157fa4]
data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
aws_iam_role_policy_attachment.ecs-ecr-policy-attachment: Refreshing state... [id=clash-bot-obs-lambda-role-20220822030052649500000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.clash_bot_error_cloudwatch_filter will be created
  + resource "aws_cloudwatch_log_subscription_filter" "clash_bot_error_cloudwatch_filter" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "{$.level = 50}"
      + id              = (known after apply)
      + log_group_name  = "clash-bot-webapp-ecs-task-logs"
      + name            = "error_event_service"
      + role_arn        = (known after apply)
    }

  # aws_iam_policy.cloudwatch_iam_policy will be updated in-place
  ~ resource "aws_iam_policy" "cloudwatch_iam_policy" {
      + description = ""
        id          = "arn:aws:iam::816923827429:policy/clash-bot-cloudwatch-lambda-policy"
        name        = "clash-bot-cloudwatch-lambda-policy"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy      = (sensitive)
        tags        = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.network_iam_policy will be created
  + resource "aws_iam_policy" "network_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clash-bot-cloudwatch-lambda-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Observability"
        }
    }

  # aws_lambda_alias.clash_bot_notification_lambda_alias will be created
  + resource "aws_lambda_alias" "clash_bot_notification_lambda_alias" {
      + arn              = (known after apply)
      + description      = "A version of the Clash Bot Notification Lambda."
      + function_name    = (known after apply)
      + function_version = "PR-Build"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "Clash_Bot_Notification_Alias"
    }

  # aws_lambda_function.clash_bot_notification_lambda will be created
  + resource "aws_lambda_function" "clash_bot_notification_lambda" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + description                    = "Used to publish error logs to the LoL-ClashBotSupport Discord server."
      + function_name                  = "clash-bot-obs-function"
      + id                             = (known after apply)
      + image_uri                      = (sensitive)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::816923827429:role/clash-bot-obs-lambda-role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Observability"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DISCORD_WEBHOOK_URL" = (sensitive)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0665c300d05157fa4",
            ]
          + subnet_ids         = (sensitive)
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_function_event_invoke_config.clash_bot_func_event_config will be created
  + resource "aws_lambda_function_event_invoke_config" "clash_bot_func_event_config" {
      + function_name          = (known after apply)
      + id                     = (known after apply)
      + maximum_retry_attempts = 2
    }

  # aws_lambda_permission.log_event_trigger_permission will be created
  + resource "aws_lambda_permission" "log_event_trigger_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "clash-bot-obs-function"
      + id                  = (known after apply)
      + principal           = "logs.us-east-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:us-east-1:816923827429:log-group:/clash-bot-*"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_security_group.clash-bot-lambda-sg will be updated in-place
  ~ resource "aws_security_group" "clash-bot-lambda-sg" {
        id                     = "sg-0665c300d05157fa4"
      ~ ingress                = (sensitive)
        name                   = "clash-bot-obs-lambda-sg"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 0 to destroy.


```

</details>

*Pushed by: @Poss111, Action: `pull_request`*